# **#49 Seleksi kolom dengan f-string**

**Import Modules**

In [3]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [ ]:
df = pd.read_csv('./data/Iris.csv')
df.head()

**Seleksi kolom dengan f-string**

- Pada dasarnya untuk menyeleksi suatu kolom kita bisa menggunakan fungsi df[]
- Fungsi toframe() digunakan untuk membuat tampilan kolom lebih rapih
- Fungsi head() digunakan untuk menampilkan 5 data pertama
- Fungsi df[] bisa dimodifikasi sehingga menggunakan fungsi f-string seperti contoh ke-2

In [ ]:
df['SepalWidthCm'].to_frame().head()

In [ ]:
part = 'Sepal'

df[f'{part}WidthCm'].to_frame().head()

In [ ]:
df[['PetalWidthCm', 'PetalLengthCm']].head()

In [ ]:
part = 'Petal'

df[[f'{part}WidthCm', f'{part}LengthCm']].head()

# **#50 Membuat kolom baru dengan for loop dan f-string**

**Import Modules**

In [12]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [15]:
d = {'penjual':['bejo', 'tejo', 'wati', 'bejo', 'cecep', 'tejo', 'wati', 'bejo'], 
     'barang':['monitor', 'monitor', 'keyboard', 'mouse', 'keyboard', 'monitor', 'laptop', 'monitor']}

df = pd.DataFrame(d)
df

  penjual    barang
0    bejo   monitor
1    tejo   monitor
2    wati  keyboard
3    bejo     mouse
4   cecep  keyboard
5    tejo   monitor
6    wati    laptop
7    bejo   monitor

**Membuat kolom baru dengan for loop dan f-string**

- Kita bisa menggunakan looping dan f-string untuk membuat beberapa kolom baru sekaligus
- Contohnya dapat kita dapat membuat 2 kolom sekaligus seperti terlihat dibawah ini

In [21]:
cols = ['penjual', 'barang']

for col in cols:
    df[f'count_tiap_{col}'] =  df.groupby(col).cumcount() + 1
    
df

  penjual    barang  count_tiap_penjual  count_tiap_barang
0    bejo   monitor                   1                  1
1    tejo   monitor                   1                  2
2    wati  keyboard                   1                  1
3    bejo     mouse                   2                  1
4   cecep  keyboard                   1                  2
5    tejo   monitor                   2                  3
6    wati    laptop                   2                  1
7    bejo   monitor                   3                  4

# **#51 Seleksi baris dengan between()**

**Import Modules**

In [25]:
import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

2.2.2
1.26.4

**Persiapan Data Frame**

In [28]:
n_rows = 10
n_cols = 5
cols = tuple('ABCDE')

df = pd.DataFrame(np.random.randint(1, 10, size=(n_rows, n_cols)), 
                  columns=cols)
df

   A  B  C  D  E
0  6  1  4  8  6
1  2  9  1  6  9
2  1  3  5  6  2
3  1  3  3  2  6
4  4  9  1  3  7
5  3  5  1  3  8
6  4  9  1  1  5
7  5  5  2  7  7
8  8  4  8  2  1
9  8  5  7  3  3

**Seleksi baris dengan between()**

- Parameter inclusive memiliki nilai default tru
- Parameter inclusive berguna untuk mengikutsertakan nilai yang tertera dalam penyeleksian

In [32]:
df[df['A'].between(2, 5)]

   A  B  C  D  E
1  2  9  1  6  9
4  4  9  1  3  7
5  3  5  1  3  8
6  4  9  1  1  5
7  5  5  2  7  7

In [ ]:
#Depricated 
df[df['A'].between(2, 5, inclusive=False)]

In [36]:
df[df['A'].between(2, 5, inclusive='left')]

   A  B  C  D  E
1  2  9  1  6  9
4  4  9  1  3  7
5  3  5  1  3  8
6  4  9  1  1  5

In [38]:
df[df['A'].between(2, 5, inclusive='right')]

   A  B  C  D  E
4  4  9  1  3  7
5  3  5  1  3  8
6  4  9  1  1  5
7  5  5  2  7  7

In [40]:
df[df['A'].between(2, 5, inclusive='both')]

   A  B  C  D  E
1  2  9  1  6  9
4  4  9  1  3  7
5  3  5  1  3  8
6  4  9  1  1  5
7  5  5  2  7  7

In [42]:
[df['A'].between(2, 5, inclusive='neither')]

[0    False
 1    False
 2    False
 3    False
 4     True
 5     True
 6     True
 7    False
 8    False
 9    False
 Name: A, dtype: bool]

# **#52 Transformasi kolom menjadi baris pada Data Frame**

**Import Modules**

In [46]:
import pandas as pd

print(pd.__version__)

2.2.2

**Persiapan Data Frame**

In [49]:
d = {
'kode_area': [123, 456, 789, 321],
'pabrik': [4, 2, 5, 0],
'gudang': [2, 4, 7, 3],
'toko': [64, 32, 15, 24]
}

df = pd.DataFrame(d)
df

   kode_area  pabrik  gudang  toko
0        123       4       2    64
1        456       2       4    32
2        789       5       7    15
3        321       0       3    24

**Transformasi kolom menjadi baris**

df.melt() adalah fungsi yang digunakan untuk mentransformasikan kolom menjadi baris penggunaan method .melt() setidaknya membutuhkan 3 parameter parameter pertama adalah id_vars yang sering kali berasosiasi dengan primary key parameter kedua adalah var_name yang berasosiasi dengan nama kolom baru hasil transformasi kolom menjadi baris parameter ketiga adalah value name yang akan menampung jumlah dari hasil transformasi kolom menjadi baris

- Fungsi melt() digunakan untuk mentrasformasikan kolom menjadi sebuah baris
- Fungsi ini membutuhkan minimal 3 buah parameter
- Parameter pertama yaitu id_vars. Digunakan untuk menetukan kunci utama/ primary key
- Parameter kedua yaitu var_name. Digunakan untuk menentukan nama kolom baru
- Parameter ketiga yaitu value_name. Digunakan untuk menampung jumlah dari kolom

In [55]:
#Melakukan melt pada DataFrame, mengonversi kolom menjadi baris
df_melted = df.melt(id_vars='kode_area', 
                    var_name='jenis_bangunan', 
                    value_name='jumlah')
df_melted

    kode_area jenis_bangunan  jumlah
0         123         pabrik       4
1         456         pabrik       2
2         789         pabrik       5
3         321         pabrik       0
4         123         gudang       2
5         456         gudang       4
6         789         gudang       7
7         321         gudang       3
8         123           toko      64
9         456           toko      32
10        789           toko      15
11        321           toko      24